jontio/dspicabootable/dspicabootable.cpp
#include "dspicabootable.h"
#include "ui_dspicabootable.h"

#include <QSerialPortInfo>
#include <QDebug>
#include <QFile>
#include <QFileDialog>
#include <QMessageBox>
#include <QSettings>
#include <QTextDocument>
#include <QTextBlock>

dspicabootable::dspicabootable(QWidget *parent) :
    QMainWindow(parent),
    ui(new Ui::dspicabootable)
{
    ui->setupUi(this);
    port=new QSerialPort(this);
    bl_stage=0;

    console_tab_enabled=false;
    if(ui->tabWidget->tabText(ui->tabWidget->currentIndex())=="Console")console_tab_enabled=true;

    testingconnection=false;

    connectiontrys=0;

    m_status=new QLabel(this);
    ui->statusBar->addWidget(m_status);
    showStatusMessage("");

    WelcomeCode code;

    code=WelcomeCode(0,"dsPIC33FJ128GP802","JPIC 1.0",1.0,1.0);
    welcomecodes[code.code]=code;

//    //you could use this for adding new devices
//    QByteArray ba;
//    ba.push_back((char)0);
//    ba.push_back((char)0);
//    qDebug()<<(qChecksum(ba.data(),2,Qt::ChecksumType::ChecksumIso3309)&0xFF);

    ui->m_console->setEnabled(true);
    ui->m_console->setLocalEchoEnabled(true);
    ui->m_console->setFocus();

    //hide advanced tab
    ui->tabWidget->removeTab(ui->tabWidget->indexOf(ui->tab_advanced));

    timeout = new QTimer(this);
    connect(timeout,SIGNAL(timeout()),this,SLOT(timeout_slot()));
    timeout->setInterval(500);

    QTimer *timeout2 = new QTimer(this);
    connect(timeout2,SIGNAL(timeout()),this,SLOT(combox_timeout()));
    timeout2->setInterval(1000);


    load_comboBox_port();

    QSettings settings;
    ui->lineEdit_filename->setText(settings.value("lineEdit_filename", DEFAULT_FILENAME).toString());
    ui->checkBox_writefuses->setChecked(settings.value("checkBox_writefuses", false).toBool());
    ui->comboBox_port->setCurrentText(settings.value("comboBox_port", "").toString());
    ui->comboBox_mpu->setCurrentText(settings.value("comboBox_mpu", "").toString());
    ui->tabWidget->setCurrentIndex(settings.value("tabWidget", "").toInt());
    ui->checkBox_localecho->setChecked(settings.value("checkBox_localecho",true).toBool());
    ui->comboBox_speed->setCurrentText(settings.value("comboBox_speed", "").toString());
    restoreGeometry(settings.value("Geometry").toByteArray());
    restoreState(settings.value("State").toByteArray());

    connect(port,SIGNAL(readyRead()),this,SLOT(portReadyRead()));
    connect(ui->m_console,SIGNAL(getData(QByteArray)),this,SLOT(console_writeData(QByteArray)));

    loadhexfile();
    if(ui->tabWidget->tabText(ui->tabWidget->currentIndex())=="Console")test_connection();

    timeout2->start();
}

void dspicabootable::putc(const char ch)
{
    if(port->write(&ch,1)!=1)ui->plainTextEdit->appendPlainText("Error writing to the serial port. This is a problem with the serial connection.");
}

Intel8HEXDecoder::DecoderReternValue dspicabootable::get_next_page(QByteArray &hexpage)
{
    quint8 ch;
    while(true)
    {

        if(bl_hextext_ptr>=bl_hextext.size())return Intel8HEXDecoder::DecoderReternValue::NoChar;
        ch=bl_hextext[bl_hextext_ptr++];

        hexpage.append((const char*)&ch,1);

        switch (intel8hexdecoder.decode(ch))
        {
        case Intel8HEXDecoder::DecoderReternValue::NewPage:
            return Intel8HEXDecoder::DecoderReternValue::NewPage;
            break;
        case Intel8HEXDecoder::DecoderReternValue::ErrorFormat:
            return Intel8HEXDecoder::DecoderReternValue::ErrorFormat;
            break;
        case Intel8HEXDecoder::DecoderReternValue::EndOfFile:
            return Intel8HEXDecoder::DecoderReternValue::EndOfFile;
            break;
        case Intel8HEXDecoder::DecoderReternValue::OK:
            break;
        default:
            return Intel8HEXDecoder::DecoderReternValue::ErrorFormat;
            break;
        }

    }

    return Intel8HEXDecoder::DecoderReternValue::ErrorFormat;

}

bool dspicabootable::put_next_page()
{

    //load a page (2048 bytes for the dsPIC33FJ128GP802)
    QByteArray ba;
    Intel8HEXDecoder::DecoderReternValue result=get_next_page(ba);

    //if we cant load a page then return false (EndOfFile and NewPage are pages)
    switch(result)
    {
    case Intel8HEXDecoder::DecoderReternValue::NoChar:
        return false;
        break;
    case Intel8HEXDecoder::DecoderReternValue::NewPage:
        break;
    case Intel8HEXDecoder::DecoderReternValue::ErrorFormat:
        return false;
        break;
    case Intel8HEXDecoder::DecoderReternValue::EndOfFile:
        break;
    case Intel8HEXDecoder::DecoderReternValue::OK:
        return false;
        break;
    default:
        return false;
        break;
    }

    //write it to the serial port
    if(ba.size())
    {
        if(port->write(ba)!=ba.size())
        {
            ui->plainTextEdit->appendPlainText("Error writing to the serial port. This is a problem with the serial connection, maybe there is a buffering issue of the serial port?");
            return false;
        }
    }
    return true;

}

//for testing
bool dspicabootable::get_next_line(QByteArray &hexline)
{
    if(bl_hextext_ptr>=bl_hextext.size())
    {
        ui->plainTextEdit->appendPlainText("No more lines");
        return false;
    }
    ui->plainTextEdit->appendPlainText("loading next line");
    int next_index=bl_hextext.indexOf(':',bl_hextext_ptr+1);
    if(next_index==-1)next_index=bl_hextext.size();
    int len=next_index-bl_hextext_ptr;
    hexline=bl_hextext.mid(bl_hextext_ptr,len);
    bl_hextext_ptr=next_index;


    switch (intel8hexdecoder.decode_line(hexline))
    {
    case Intel8HEXDecoder::DecoderReternValue::NewPage:
        ui->plainTextEdit->appendPlainText("NewPage");
        break;
    case Intel8HEXDecoder::DecoderReternValue::ErrorFormat:
        ui->plainTextEdit->appendPlainText("ErrorFormat");
        break;
    case Intel8HEXDecoder::DecoderReternValue::EndOfFile:
        ui->plainTextEdit->appendPlainText("EndOfFile");
        break;
    case Intel8HEXDecoder::DecoderReternValue::OK:
        ui->plainTextEdit->appendPlainText("OK");
        break;
    default:
        ui->plainTextEdit->appendPlainText("Unknown return type");
        break;
    }


