jontio/dspicabootable/dspicabootable.cpp
    return true;
}

bool dspicabootable::loadhexfile()
{

    ui->plainTextEdit->clear();

    QString filename=ui->lineEdit_filename->text();

    //init decoder
    quint8 ch;
   // int lastlinecount=0;
    intel8hexdecoder.reset();

    intel8hexdecoder.usefuses=ui->checkBox_writefuses->isChecked();

    //load hex file
    bl_hextext.clear();
    bl_hextext_ptr=0;
    bl_hextext_number_of_lines=-1;
    QFile file(filename);
    if (!file.open(QIODevice::ReadOnly | QIODevice::Text))
    {
        ui->plainTextEdit->appendPlainText("Error: Can't open file");
        return false;
    }
    bl_hextext=file.readAll();
    bl_hextext=bl_hextext.toUpper();
    file.close();

    ui->plainTextEdit->appendPlainText("Scanning File...");

    //scan through hex file
    while(true)
    {
        if(bl_hextext_ptr>=bl_hextext.size())
        {
            ui->plainTextEdit->appendPlainText("Unexpected End Of File");
            return false;
        }
        ch=bl_hextext[bl_hextext_ptr++];

        switch (intel8hexdecoder.decode(ch))
        {
        case Intel8HEXDecoder::DecoderReternValue::NewPage:
 //           qDebug()<<"NewPage";
            break;
        case Intel8HEXDecoder::DecoderReternValue::ErrorFormat:
//            qDebug()<<"ErrorFormat";
            ui->plainTextEdit->appendPlainText("Error: File Format");
            return false;
            break;
        case Intel8HEXDecoder::DecoderReternValue::EndOfFile:
            ui->plainTextEdit->appendPlainText("File Read successfully");
            ui->plainTextEdit->appendPlainText(QString::number(intel8hexdecoder.line_count)+" Lines");
   //         qDebug()<<"EndOfFile";

        //    ui->plainTextEdit->appendPlainText(intel8hexdecoder.outputhexdata);


            //bl_hextext=intel8hexdecoder.outputhexdata;
            //bl_hextext_number_of_lines=intel8hexdecoder.line_count;

            //rephreased hex file. this gets rid of the mess that microchip does with their phrasing
            bl_hextext=intel8hexdecoder.form;
            bl_hextext.replace("\n","");
            bl_hextext_number_of_lines=intel8hexdecoder.form.linecount;

            //ui->plainTextEdit->setPlainText(bl_hextext);

            bl_hextext_ptr=0;
            intel8hexdecoder.reset();


//{
//      QByteArray hexline;
//      while(get_next_line(hexline))
//      {
//          ui->plainTextEdit->appendPlainText(((QString)"type=%1 page=%2").arg(intel8hexdecoder.type).arg(intel8hexdecoder.page));
//          ui->plainTextEdit->appendPlainText(hexline+"\n");
//      }
//}

            return true;
            break;
        case Intel8HEXDecoder::DecoderReternValue::OK:
            //qDebug()<<"OK";
            break;
        default:
   //         qDebug()<<"Unknown return type";
            ui->plainTextEdit->appendPlainText("Error: Unknown Type Format");
            return false;
            break;
        }

//        if(lastlinecount!=intel8hexdecoder.line_count)
//        {
//            lastlinecount=intel8hexdecoder.line_count;
//            qDebug()<<"Line count="<<lastlinecount;
//        }



    }

    ui->plainTextEdit->appendPlainText("Error: No End Of File Type Given");

    return false;

}

void dspicabootable::timeout_slot()
{
    bool okconnection=false;
    if(!timeout->isActive())return;
    if((bl_stage<5)&&(bl_stage>0))
    {
        ui->plainTextEdit->appendPlainText("Timeout: Got some responce from device I just don't know what it is.");
    }
     else
     {
        switch (bl_stage)
        {
        case 0:
            ui->plainTextEdit->appendPlainText("Timeout: No responce");
            showStatusMessage("Timeout: No responce");
            break;
        case 5:
            ui->plainTextEdit->appendPlainText("Timeout: Connection lost");
            showStatusMessage("Timeout: Connection lost");
            break;
        case 6:
            if(bl_rxed_number_of_acks==bl_hextext_number_of_lines)
            {
                ui->plainTextEdit->appendPlainText("Success: All done");
                showStatusMessage("Success: All done");
            }
             else
             {
                ui->plainTextEdit->appendPlainText("Failure: Did not receive the expected number of ACKs from device.");
                showStatusMessage("Failure: Did not receive the expected number of ACKs from device.");
             }
            okconnection=true;
            break;
        case 11:
            if(!testingconnection)
            {
                ui->plainTextEdit->appendPlainText("Fail: Error writting data");
                showStatusMessage("Fail: Error writting data");
            }
             else
             {
                ui->plainTextEdit->appendPlainText("Fail: Error connecting with device");
                showStatusMessage("Fail: Error connecting with device");
             }
            break;
        case 12:
            ui->plainTextEdit->appendPlainText("Fail: Error writting data due to local PC copy of program");
            showStatusMessage("Fail: Error writting data due to local PC copy of program");
            break;
        case 13:
            if(console_tab_enabled)
            {
                showStatusMessage("Port opened");
                ui->m_console->portopen=true;
                break;
            }
            ui->plainTextEdit->appendPlainText("Connection OK");
            if(bl_hextext_number_of_lines<=0)showStatusMessage("Connection OK but can't burn!!!");
             else
             {
                showStatusMessage("Connection OK");
                okconnection=true;
             }
            break;
        default:
            ui->plainTextEdit->appendPlainText("Timeout: Unknown");
            showStatusMessage("Timeout: Unknown");
            break;
        }

     }
    timeout->stop();
    if(okconnection)ui->pushButton_burn->setEnabled(true);
    ui->tabWidget->setEnabled(true);
}

void dspicabootable::portReadyRead()
{
    QByteArray ba=port->readAll();

    if(console_tab_enabled&&(bl_stage==13))ui->m_console->putData(ba);

    if(bl_stage==5)timeout->start();

    for(int i=0;i<ba.size();i++)
    {

        //start off by waiting for the SYNC from the device
        if(bl_stage==0)
        {
            if(ba[i]==(char)SYNC)
            {
                putc(ESC);
                bl_stage=1;
            }
            continue;
        }

