jontio/dspicabootable/dspicabootable.cpp
        //then wait for the SOH. if it didn't hear our ESC and it sends a SYNC again then send the ESC again. anything else makes us go back to stage 0
        if(bl_stage==1)
        {
            if(ba[i]==SOH)
            {
                //ui->plainTextEdit->appendPlainText("<SOH>");
                bl_stage=2;
                continue;
            }
            if(ba[i]==(char)SYNC)
            {
                putc(ESC);
                continue;
            }
            bl_stage=0;
            continue;
        }

        //fill in welcome packet from bootloader that tells us about the device we are talking to
        if(bl_stage>=2&&bl_stage<=4)
        {
            welcome_packet_from_bootloader.resize(3);
            welcome_packet_from_bootloader[bl_stage-2]=ba[i];
            bl_stage++;
            bl_rxed_number_of_acks=0;
            if(bl_stage==5)
            {
                if(((quint8)welcome_packet_from_bootloader[2])!=(quint8)(qChecksum(welcome_packet_from_bootloader.data(),2,Qt::ChecksumType::ChecksumIso3309)&0x00FF))
                {
                    ui->plainTextEdit->appendPlainText("Device packet = \""+welcome_packet_from_bootloader.toHex()+"\"");
                    ui->plainTextEdit->appendPlainText(((QString)"Device CRC failed (received=0x%1 expected=0x%2)").arg(((quint8)welcome_packet_from_bootloader[2]),2,16,QChar('0')).arg((quint8)(qChecksum(welcome_packet_from_bootloader.data(),2,Qt::ChecksumType::ChecksumIso3309)&0x00FF),2,16,QChar('0'))   );
                    bl_stage=11;
                }

                quint16 welcomecode=(((quint16)((quint8)welcome_packet_from_bootloader[1]))<<8) | ((quint16)((quint8)welcome_packet_from_bootloader[0]));
                if(!welcomecodes.contains(welcomecode))
                {
                  ui->plainTextEdit->appendPlainText("Device responded with ID "+QString::number(welcomecode)+". This number isn't known");
                  bl_stage=11;
                }
                 else
                 {
                    ui->plainTextEdit->appendPlainText(welcomecodes[welcomecode]);
                    if(ui->comboBox_mpu->currentText()!=welcomecodes[welcomecode].mpu_string)
                    {
                        ui->plainTextEdit->appendPlainText("Device responce doesn't match desired MPU in the MPU combo box above");
                        bl_stage=11;
                    }
                     else
                     {
                        if(!testingconnection)ui->plainTextEdit->appendPlainText("Burning...");
                     }

                 }

                if((testingconnection)&&(bl_stage!=11))bl_stage=13;
//stop for testing
//if(bl_stage!=13)bl_stage=11;


            }
            continue;
        }

        if(bl_stage==5)
        {

            switch (ba[i])
            {
            case ACKLOD:
                //ui->plainTextEdit->appendPlainText("<ACK>");
                bl_rxed_number_of_acks++;
                //ui->plainTextEdit->appendPlainText(((QString)"ACKs received %1 Total number of ACKs expected %2").arg(bl_rxed_number_of_acks).arg(bl_hextext_number_of_lines));
                break;
            case NAKLOD:
                ui->plainTextEdit->appendPlainText("<NAK>");
                bl_stage=11;
                break;
            case READY:
                //ui->plainTextEdit->appendPlainText("<READY>");
                {
                    double progress=100.0*(((double)bl_rxed_number_of_acks)/((double)bl_hextext_number_of_lines));
                    QString str="  "+(((QString)"%1% done").arg(  progress,'f',0, 2,QLatin1Char(' '))).trimmed();//"trimmed"???
                    //ui->statusBar->showMessage(str,5000);
                    showStatusMessage(str);
                }
                if(!put_next_page())bl_stage=12;
                break;
            case EOT:
                //ui->plainTextEdit->appendPlainText("<EOT>");
                bl_stage=6;
                break;
            case WRITE_FAIL:
                ui->plainTextEdit->appendPlainText("<WRITE_FAIL>");
                bl_stage=11;
                break;
            case ERROR_UNKNOWN_TYPE:
                ui->plainTextEdit->appendPlainText("<ERROR_UNKNOWN_TYPE>");
                bl_stage=11;
                break;
            case ERROR_BOOTLOADER_ADDRESS_OR_OUT_OF_BOUNDS_ADDRESS_OR_LACK_OF_DATA:
                ui->plainTextEdit->appendPlainText("<ERROR_BOOTLOADER_ADDRESS_OR_OUT_OF_BOUNDS_ADDRESS_OR_LACK_OF_DATA>");
                bl_stage=11;
                break;
            default:
                break;
            }
            continue;
        }

    }

    return;
}

void dspicabootable::console_writeData(const QByteArray &data)
{
    if(console_tab_enabled&&(bl_stage==13))
    {
        port->write(data);
    }
}

void dspicabootable::load_comboBox_port()
{
    QList<QSerialPortInfo> ports=QSerialPortInfo::availablePorts();
    bool changed=false;
    if(ui->comboBox_port->count()!=ports.size())changed=true;
    for(int i=0;(i<ports.size())&&(i<ui->comboBox_port->count())&&(!changed);i++)
    {
        QString str=ports[i].portName()+" ("+ports[i].description()+")";
        if(ui->comboBox_port->itemText(i)!=str)
        {
           changed=true;
        }
    }
    if(!changed)return;
    QString str=ui->comboBox_port->currentText();
    ui->comboBox_port->clear();
    for(int i=0;i<ports.size();i++)ui->comboBox_port->addItem(ports[i].portName()+" ("+ports[i].description()+")");
    ui->comboBox_port->setCurrentText(str);
}

dspicabootable::~dspicabootable()
{
    QSettings settings;
    settings.setValue("lineEdit_filename", ui->lineEdit_filename->text());
    settings.setValue("checkBox_writefuses", ui->checkBox_writefuses->isChecked());
    settings.setValue("comboBox_port", ui->comboBox_port->currentText());
    settings.setValue("comboBox_mpu", ui->comboBox_mpu->currentText());
    settings.setValue("tabWidget",ui->tabWidget->currentIndex());
    settings.setValue("checkBox_localecho", ui->checkBox_localecho->isChecked());
    settings.setValue("comboBox_speed", ui->comboBox_speed->currentText());
    settings.setValue("Geometry", saveGeometry());
    settings.setValue("State", saveState());

