jontio/dspicabootable/dspicabootable.cpp
    delete ui;
}

void dspicabootable::clear_RequestToSend()
{
   if(port->isOpen())
   {
       //port->setRequestToSend(false);
       port->setDataTerminalReady(true);//sets low
   }
}

void dspicabootable::connect_to_device()
{
    ui->pushButton_burn->setEnabled(false);
    ui->m_console->portopen=false;

    if(port->isOpen())port->close();

    bl_stage=0;
    bl_rxed_number_of_acks=-1;
    bl_hextext_ptr=0;
    if(bl_hextext_number_of_lines<=0)
    {
        ui->plainTextEdit->appendPlainText("No Successfully Loaded Hex File");
        if(!testingconnection)
        {
            showStatusMessage("No Successfully Loaded Hex File");
            //ui->pushButton_burn->setEnabled(true);
            //return;
            testingconnection=true;
        }
    }

    QList<QSerialPortInfo> ports=QSerialPortInfo::availablePorts();
    for(int i=0;i<ports.size();i++)
    {
        QStringList port_name_and_description=ui->comboBox_port->currentText().split(" ");
        QString port_name=port_name_and_description[0];
        if(port_name==ports[i].portName())
        {
            ui->plainTextEdit->appendPlainText("Opening "+port_name);

            port->setPort(ports[i]);

            ui->m_console->setLocalEchoEnabled(ui->checkBox_localecho->isChecked());

            if(console_tab_enabled)
            {
                if(ui->comboBox_speed->currentText()!="Default")
                {
                    port->setBaudRate(ui->comboBox_speed->currentText().toInt());
                }
                 else port->setBaudRate(DEFAULT_SPEED);
                bl_stage=13;
            }
             else port->setBaudRate(DEFAULT_SPEED);
            port->setDataBits(QSerialPort::Data8);
            port->setFlowControl(QSerialPort::NoFlowControl);
            port->setParity(QSerialPort::NoParity);
            port->setStopBits(QSerialPort::OneStop);
            if(!port->open(QIODevice::ReadWrite))
            {
                ui->plainTextEdit->appendPlainText("Can't open com port");
                showStatusMessage("Can't open com port");
                return;
            }

            //disable ui till the burn is done, timeout etc
            if(!testingconnection)ui->tabWidget->setEnabled(false);

            timeout->start();

            //reset device by  pulling down the RTS line for 200ms
            //port->setRequestToSend(true);
        //    port->setDataTerminalReady(false);//sets high
        //    QTimer::singleShot(200, this, SLOT(clear_RequestToSend()));
        }
    }
}

void dspicabootable::test_connection()
{
    connectiontrys++;
    testingconnection=true;
    connect_to_device();
}

void dspicabootable::on_pushButton_burn_clicked()
{
    loadhexfile();
    testingconnection=false;
    connect_to_device();
}

void dspicabootable::on_action_Open_triggered()
{
    QString hexfilename = QFileDialog::getOpenFileName(this,tr("Open Intel8Hex"), ui->lineEdit_filename->text(), tr("Image Files (*.hex)"));
    if(hexfilename.trimmed().isEmpty())hexfilename=ui->lineEdit_filename->text();
    ui->lineEdit_filename->setText(hexfilename);
    loadhexfile();
    test_connection();
}

void dspicabootable::on_toolButton_openhex_clicked()
{
    on_action_Open_triggered();
}

void dspicabootable::on_action_About_triggered()
{

        QMessageBox::about(this,"dsPICaBootable",""
                                         "<H1>A bootloader for PIC microcontrollers</H1>"
                                         "<H3>v1.1</H3>"
                                         "<p>This program can be used to write programms to <a href=\"https://www.microchip.com/design-centers/microcontrollers\">PIC</a> microcontrolers without the need for for an external programming device such as the <a href=\"https://www.microchip.com/developmenttools/ProductDetails/PG164140\">PICkit</a>. Have a look at wikipedia <a href=\"https://en.wikipedia.org/wiki/PIC_microcontrollers\">https://en.wikipedia.org/wiki/PIC_microcontrollers</a> for more info about these PIC chips.</p>"
                                         "<p>For more information about this application see <a href=\"http://jontio.zapto.org/hda1/dspicabootable.html\">http://jontio.zapto.org/hda1/dspicabootable.html</a>.</p>"
                                         "<p>Currently only dsPIC33fj128GP802 has a bootloader written for it.</p>"
                                         "<p>Jonti 2019</p>" );

}

void dspicabootable::on_checkBox_writefuses_stateChanged(int usefuses)
{
    Q_UNUSED(usefuses);
    loadhexfile();
    test_connection();
}

void dspicabootable::on_lineEdit_filename_editingFinished()
{
    loadhexfile();
    test_connection();
}

void dspicabootable::on_checkBox_writefuses_clicked(bool checked)
{

    if(!checked)return;

    QMessageBox msgBox;
    msgBox.setIcon(QMessageBox::Warning);
    msgBox.setText("Writeing the fuses may brick the chip and requre an ICSP device to reprogram the device. Don't check this unless you really know what you are doing.");
    msgBox.setInformativeText("Are you sure you want to write the fuses?");
    msgBox.setStandardButtons(QMessageBox::Yes | QMessageBox::No);
    msgBox.setDefaultButton(QMessageBox::Yes);
    switch (msgBox.exec())
    {
    case QMessageBox::Yes:
        return;
        break;
    default:
        break;
    }

    ui->checkBox_writefuses->setChecked(false);

}

void dspicabootable::combox_timeout()
{
    //poll the serial port avalability
    load_comboBox_port();

    //if we cant connect to device then try again
    if((ui->tabWidget->tabText(ui->tabWidget->currentIndex())=="Upload")&&(!timeout->isActive())&&(!ui->pushButton_burn->isEnabled())&&(testingconnection))
    {
        if(connectiontrys<3)
        {
            test_connection();
        }
    } else connectiontrys=0;

    //close port if done
    if((ui->tabWidget->tabText(ui->tabWidget->currentIndex())=="Upload")&&(!timeout->isActive()))port->close();

}

void dspicabootable::on_comboBox_port_currentIndexChanged(int index)
{
    Q_UNUSED(index)
    connectiontrys=0;
    ui->plainTextEdit->clear();
    test_connection();
}

void dspicabootable::on_comboBox_mpu_currentIndexChanged(int index)
{
    Q_UNUSED(index)
    ui->plainTextEdit->clear();
    test_connection();
}

void dspicabootable::writeData(const QByteArray &data)
{
    port->write(data);
}

void dspicabootable::showStatusMessage(const QString &message)
{
    m_status->setText(" "+message+" ");
}

void dspicabootable::on_tabWidget_currentChanged(int index)
{
    if(ui->tabWidget->tabText(index)=="Console")
    {
        console_tab_enabled=true;
        ui->m_console->setFocus();
    }
     else console_tab_enabled=false;
    ui->plainTextEdit->clear();
    ui->m_console->clear();
    test_connection();
}
